In [6]:
import sqlite3
import pandas as pd

# Create in-memory database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

prompt: "Select all employees and order them by salary in descending order."

In [11]:
cursor.execute('''DROP TABLE IF EXISTS employees;''')
cursor.execute('''
    CREATE TABLE employees (
        id INT PRIMARY KEY,
        name VARCHAR(50),
        department VARCHAR(50),
        salary DECIMAL(10, 2),
        join_date DATE
    )
''')

cursor.execute('''
    INSERT INTO employees (id, name, department, salary, join_date) VALUES
    (1, 'Alice Smith', 'Sales', 60000.00, '2022-01-15'),
    (2, 'Bob Johnson', 'IT', 75000.00, '2021-08-20'),
    (3, 'Charlie Brown', 'Sales', 62000.00, '2022-03-10'),
    (4, 'David Lee', 'Marketing', 68000.00, '2023-02-01'),
    (5, 'Eve Adams', 'IT', 78000.00, '2021-11-05')
''')

conn.commit()

In [12]:
cursor.execute('SELECT * FROM employees ORDER BY salary DESC')
rows = cursor.fetchall()

for row in rows:
    print(row)

(5, 'Eve Adams', 'IT', 78000, '2021-11-05')
(2, 'Bob Johnson', 'IT', 75000, '2021-08-20')
(4, 'David Lee', 'Marketing', 68000, '2023-02-01')
(3, 'Charlie Brown', 'Sales', 62000, '2022-03-10')
(1, 'Alice Smith', 'Sales', 60000, '2022-01-15')

prompt: "How can I select all employees from the 'IT' department?"

In [14]:
cursor.execute("SELECT * FROM employees WHERE department = 'IT'")
rows = cursor.fetchall()

for row in rows:
    print(row)

(2, 'Bob Johnson', 'IT', 75000, '2021-08-20')
(5, 'Eve Adams', 'IT', 78000, '2021-11-05')

prompt: "Create a 'departments' table and insert some data, then perform an INNER JOIN with the 'employees' table."

In [24]:
cursor.execute('''
    CREATE TABLE departments (
        dept_id INT PRIMARY KEY,
        dept_name VARCHAR(50)
    )
''')

cursor.execute('''
    INSERT INTO departments (dept_id, dept_name) VALUES
    (1, 'Sales'),
    (2, 'IT'),
    (3, 'Marketing')
''')

conn.commit()

# Assuming 'department' in employees table corresponds to 'dept_name' in departments table
# For a proper join, we might need a foreign key in the employees table referencing dept_id in departments.
# However, for demonstration purposes with existing data, we can join on the department name.
cursor.execute('''
    SELECT employees.name, employees.department, departments.dept_name
    FROM employees
    INNER JOIN departments ON employees.department = departments.dept_name
''')

rows = cursor.fetchall()
for row in rows:
    print(row)

('Alice Smith', 'Sales', 'Sales')
('Bob Johnson', 'IT', 'IT')
('Charlie Brown', 'Sales', 'Sales')
('Eve Adams', 'IT', 'IT')

prompt: "Update the salary of 'Alice Smith' to 65000.00."

In [15]:
cursor.execute("UPDATE employees SET salary = 65000.00 WHERE name = 'Alice Smith'")
conn.commit()
cursor.execute("SELECT * FROM employees WHERE name = 'Alice Smith'")
print(cursor.fetchone())

(1, 'Alice Smith', 'Sales', 65000, '2022-01-15')

prompt: "Delete the employee with the ID of 4."

In [16]:
cursor.execute("DELETE FROM employees WHERE id = 4")
conn.commit()
cursor.execute("SELECT * FROM employees")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Alice Smith', 'Sales', 65000, '2022-01-15')
(2, 'Bob Johnson', 'IT', 75000, '2021-08-20')
(3, 'Charlie Brown', 'Sales', 62000, '2022-03-10')
(5, 'Eve Adams', 'IT', 78000, '2021-11-05')

prompt: "Calculate the average salary of all employees."

In [17]:
cursor.execute("SELECT AVG(salary) FROM employees")
print(cursor.fetchone())

(70000.0,)

prompt: "Find the highest salary in the 'IT' department."

In [18]:
cursor.execute("SELECT MAX(salary) FROM employees WHERE department = 'IT'")
print(cursor.fetchone())

(78000,)

prompt: "Count the number of employees in each department."

In [19]:
cursor.execute("SELECT department, COUNT(*) FROM employees GROUP BY department")
rows = cursor.fetchall()
for row in rows:
    print(row)

('IT', 2)
('Sales', 2)

prompt: "Select employees whose name starts with 'B'."

In [20]:
cursor.execute("SELECT * FROM employees WHERE name LIKE 'B%'")
rows = cursor.fetchall()
for row in rows:
    print(row)

(2, 'Bob Johnson', 'IT', 75000, '2021-08-20')

prompt: "Select employees who joined in 2022."

In [21]:
cursor.execute("SELECT * FROM employees WHERE strftime('%Y', join_date) = '2022'")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Alice Smith', 'Sales', 65000, '2022-01-15')
(3, 'Charlie Brown', 'Sales', 62000, '2022-03-10')

prompt: "Select employees with a salary between 60000 and 70000."

In [22]:
cursor.execute("SELECT * FROM employees WHERE salary BETWEEN 60000 AND 70000")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Alice Smith', 'Sales', 65000, '2022-01-15')
(3, 'Charlie Brown', 'Sales', 62000, '2022-03-10')

prompt: "Select employees from 'Sales' or 'Marketing' departments."

In [23]:
cursor.execute("SELECT * FROM employees WHERE department IN ('Sales', 'Marketing')")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Alice Smith', 'Sales', 65000, '2022-01-15')
(3, 'Charlie Brown', 'Sales', 62000, '2022-03-10')